In [1]:
import numpy as np
import pandas as pd

C:\Users\rohit\AppData\Local\Temp\ipykernel_11320\1662815981.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [3]:
date.sample(5)

           date  product_id  city_id  orders
868  2018-09-01        3679        6       2
896  2019-05-29        4586       22       2
665  2018-09-29         146       16       5
910  2019-04-25        2504        2       2
316  2019-01-24        4173       23       2

In [4]:
time.sample(5)

                    date                                                msg
842  2016-07-25 23:27:00  парень ищет любовницу для встречь интимных 093...
50   2012-05-17 02:22:00  нормальный парень хочет познакомитса с хорошей...
533  2014-08-16 23:53:00      Мужч  40 170 75 ищет друга смс ммс 0994283423
146  2012-05-12 23:40:00  Користувач ВЕЗУЧАЯ-Я проголосував ЗА кліп Cris...
676  2013-08-12 23:36:00  ЧТО МОДЕР СМС НЕ ПО ДУШЕ? ТЫ ЕЩЁ НЕ ЗНАЕШЬ НА ...

In [5]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [6]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [8]:
#Converting date to datetime datatype
date['date'] = pd.to_datetime(date['date'])
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

Working with DATE

In [20]:
#Extract year
date['date_yr'] = date['date'].dt.year

#Extract Month
date['date_month_no'] = date['date'].dt.month

#Extract Day
date['date_day'] = date['date'].dt.day

#Extract Day of the Week
date['date_dow'] = date['date'].dt.day_of_week

#Extract Day Name
date['date_day'] = date['date'].dt.day_name()

#Extract by checking for Weekend
date['is_Weekend'] = np.where(date['date_day'].isin(['Sunday','Saturday']),1,0)

#Extract Week of year
date['date_week'] = date['date'].dt.isocalendar().week

#Extract Quarter
date['quarter'] = date['date'].dt.quarter

#Extract Semester
date['Semester'] = np.where(date['quarter'].isin([1,2]),1,2)

date.drop(columns=['product_id','city_id','orders'])

date.head()

,date,product_id,city_id,orders,date_yr,date_month_no,date_day,date_dow,is_Weekend,date_week,quarter,Semester
0,2019-12-10,5628,25,3,2019,12,Tuesday,1,0,50,4,2
1,2018-08-15,3646,14,157,2018,8,Wednesday,2,0,33,3,2
2,2018-10-23,1859,25,1,2018,10,Tuesday,1,0,43,4,2
3,2019-08-17,7292,25,1,2019,8,Saturday,5,1,33,3,2
4,2019-01-06,4344,25,3,2019,1,Sunday,6,1,1,1,1

Extract Time elapsed between dates

In [22]:
import datetime

today = datetime.datetime.today()
today - date['date']

0     1576 days 05:24:37.779253
1     2058 days 05:24:37.779253
2     1989 days 05:24:37.779253
3     1691 days 05:24:37.779253
4     1914 days 05:24:37.779253
                 ...
995   2004 days 05:24:37.779253
996   1945 days 05:24:37.779253
997   1793 days 05:24:37.779253
998   1858 days 05:24:37.779253
999   1632 days 05:24:37.779253
Name: date, Length: 1000, dtype: timedelta64[ns]

In [23]:
(today - date['date']).dt.days

0      1576
1      2058
2      1989
3      1691
4      1914
       ...
995    2004
996    1945
997    1793
998    1858
999    1632
Name: date, Length: 1000, dtype: int64

In [51]:
#Months Passed
np.round(((today - date['date'])/np.timedelta64(1,'W'))/4.3,0)

0      52.0
1      68.0
2      66.0
3      56.0
4      64.0
       ...
995    67.0
996    65.0
997    60.0
998    62.0
999    54.0
Name: date, Length: 1000, dtype: float64

In [30]:
#Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [31]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

Extract Time Part

In [32]:
time['time'] = time['date'].dt.time
time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

Time Difference

In [33]:
today-time['date']

0     3762 days 04:34:37.779253
1     3626 days 05:44:37.779253
2     4112 days 05:03:37.779253
3     3414 days 04:53:37.779253
4     3811 days 06:13:37.779253
                 ...
995   4401 days 04:34:37.779253
996   3722 days 06:10:37.779253
997   4187 days 05:47:37.779253
998   4303 days 05:50:37.779253
999   3575 days 05:59:37.779253
Name: date, Length: 1000, dtype: timedelta64[ns]

In [34]:
#in seconds
(today-time['date'])/np.timedelta64(1,'s')

0      3.250533e+08
1      3.133071e+08
2      3.552950e+08
3      2.949872e+08
4      3.292928e+08
           ...
995    3.802629e+08
996    3.216030e+08
997    3.617777e+08
998    3.718002e+08
999    3.089016e+08
Name: date, Length: 1000, dtype: float64

In [36]:
#in minutes
(today-time['date'])/np.timedelta64(1,'m')

0      5.417555e+06
1      5.221785e+06
2      5.921584e+06
3      4.916454e+06
4      5.488214e+06
           ...
995    6.337715e+06
996    5.360051e+06
997    6.029628e+06
998    6.196671e+06
999    5.148360e+06
Name: date, Length: 1000, dtype: float64

In [52]:
#in hours
(today-time['date'])/np.timedelta64(1,'h')

0       90292.577161
1       87029.743828
2       98693.060494
3       81940.893828
4       91470.227161
           ...
995    105628.577161
996     89334.177161
997    100493.793828
998    103277.843828
999     85805.993828
Name: date, Length: 1000, dtype: float64